In [3]:
import pandas as pd

In [4]:
my_series = pd.Series([1, 2, 3, 4, 5])

In [5]:
my_series

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
my_series ** 5

0       1
1      32
2     243
3    1024
4    3125
dtype: int64

In [7]:
weather = pd.DataFrame({
    'City': ['MSK', 'SPB', 'NN'],
    'Temp': [-3, +2, -2],
    'State': ['Cloudy', 'Clear', 'Snow']
})

In [8]:
weather

  City  Temp   State
0  MSK    -3  Cloudy
1  SPB     2   Clear
2   NN    -2    Snow

In [9]:
weather.set_index('City', inplace=True)
weather

      Temp   State
City
MSK     -3  Cloudy
SPB      2   Clear
NN      -2    Snow

In [10]:
df = pd.read_csv('names/yob1880.txt')
df

           Mary  F  7065
0          Anna  F  2604
1          Emma  F  2003
2     Elizabeth  F  1939
3        Minnie  F  1746
4      Margaret  F  1578
...         ... ..   ...
1994     Woodie  M     5
1995     Worthy  M     5
1996     Wright  M     5
1997       York  M     5
1998  Zachariah  M     5

[1999 rows x 3 columns]

In [11]:
df = pd.read_csv('names/yob1880.txt', header=None)
df

              0  1     2
0          Mary  F  7065
1          Anna  F  2604
2          Emma  F  2003
3     Elizabeth  F  1939
4        Minnie  F  1746
...         ... ..   ...
1995     Woodie  M     5
1996     Worthy  M     5
1997     Wright  M     5
1998       York  M     5
1999  Zachariah  M     5

[2000 rows x 3 columns]

In [12]:
df = pd.read_csv('names/yob1880.txt', names=['Name', 'Gender', 'Count'])
df

           Name Gender  Count
0          Mary      F   7065
1          Anna      F   2604
2          Emma      F   2003
3     Elizabeth      F   1939
4        Minnie      F   1746
...         ...    ...    ...
1995     Woodie      M      5
1996     Worthy      M      5
1997     Wright      M      5
1998       York      M      5
1999  Zachariah      M      5

[2000 rows x 3 columns]

In [13]:
df.shape

(2000, 3)

In [14]:
df['Gender'].value_counts()

M    1058
F     942
Name: Gender, dtype: int64

In [15]:
df['Gender']
# df[['Gender']]
var = df[df['Gender'] == 'M']
df['Name'] == 'John'

0       False
1       False
2       False
3       False
4       False
        ...
1995    False
1996    False
1997    False
1998    False
1999    False
Name: Name, Length: 2000, dtype: bool

In [16]:
df[df['Name'] == 'John']

     Name Gender  Count
228  John      F     46
942  John      M   9655

In [17]:
print(df[(df['Gender'] == 'M') & (df['Name'] == 'John')])
print(df[(df['Gender'] == 'F') & (df['Name'] == 'John')])

     Name Gender  Count
942  John      M   9655
     Name Gender  Count
228  John      F     46

In [18]:
weather.loc['NN']

Temp       -2
State    Snow
Name: NN, dtype: object

In [19]:
weather.sort_values('Temp')

      Temp   State
City
MSK     -3  Cloudy
NN      -2    Snow
SPB      2   Clear

In [20]:
df.sort_values('Name')

        Name Gender  Count
1072   Aaron      M    102
1850      Ab      M      5
177    Abbie      F     71
1851  Abbott      M      5
737     Abby      F      6
...      ...    ...    ...
340      Zoe      F     23
736     Zola      F      7
677     Zona      F      8
303     Zora      F     28
307     Zula      F     27

[2000 rows x 3 columns]

In [21]:
df.sort_values(by='Name')

        Name Gender  Count
1072   Aaron      M    102
1850      Ab      M      5
177    Abbie      F     71
1851  Abbott      M      5
737     Abby      F      6
...      ...    ...    ...
340      Zoe      F     23
736     Zola      F      7
677     Zona      F      8
303     Zora      F     28
307     Zula      F     27

[2000 rows x 3 columns]

In [22]:
df_1 = pd.read_csv('names/yob2015.txt', names=['Name', 'Gender', 'Count'])
df_1['Year'] = 2017
df_2 = pd.read_csv('names/yob2016.txt', names=['Name', 'Gender', 'Count'])
df_2['Year'] = 2016
df_3 = pd.read_csv('names/yob2017.txt', names=['Name', 'Gender', 'Count'])
df_3['Year'] = 2015

In [23]:
df_res = pd.concat([df_1, df_2, df_3])
df_res.reset_index()

       index      Name Gender  Count  Year
0          0      Emma      F  20455  2017
1          1    Olivia      F  19691  2017
2          2    Sophia      F  17417  2017
3          3       Ava      F  16378  2017
4          4  Isabella      F  15617  2017
...      ...       ...    ...    ...   ...
98716  32585     Zykai      M      5  2015
98717  32586    Zykeem      M      5  2015
98718  32587     Zylin      M      5  2015
98719  32588     Zylis      M      5  2015
98720  32589     Zyrie      M      5  2015

[98721 rows x 5 columns]

In [24]:
df_res[df_res['Name'] == 'Aaban']

        Name Gender  Count  Year
24821  Aaban      M     15  2017
26969  Aaban      M      9  2016
25445  Aaban      M     11  2015

In [25]:
df_res.groupby('Name').sum()

           Count  Year
Name
Aaban         35  6048
Aabha         14  4033
Aabid          5  2016
Aabir          5  2016
Aabriella     22  6048
...          ...   ...
Zyron         42  6048
Zyrus         18  6048
Zyus           5  2017
Zyva          17  4031
Zyvon          7  2017

[39801 rows x 2 columns]

In [26]:
df_res['Lenght'] = df_res['Name'].map(len)
df_res

           Name Gender  Count  Year  Lenght
0          Emma      F  20455  2017       4
1        Olivia      F  19691  2017       6
2        Sophia      F  17417  2017       6
3           Ava      F  16378  2017       3
4      Isabella      F  15617  2017       8
...         ...    ...    ...   ...     ...
32585     Zykai      M      5  2015       5
32586    Zykeem      M      5  2015       6
32587     Zylin      M      5  2015       5
32588     Zylis      M      5  2015       5
32589     Zyrie      M      5  2015       5

[98721 rows x 5 columns]

In [27]:
stacked_df = df_res.groupby(['Gender', 'Year']).mean()[['Lenght']]
stacked_df

               Lenght
Gender Year
F      2015  6.283320
       2016  6.291941
       2017  6.304699
M      2015  5.946676
       2016  5.968675
       2017  5.977762

In [30]:
unstacked_df = stacked_df.unstack('Year')

In [31]:
unstacked_df

          Lenght
Year        2015      2016      2017
Gender
F       6.283320  6.291941  6.304699
M       5.946676  5.968675  5.977762